import Engine from '../assets/gearbox-engine.svg?react';
import Electric  from '../assets/copper-wire.svg?react';
import Operations  from '../assets/operations.svg?react';
import Transmission  from '../assets/transmission.svg?react';
import Chassis  from '../assets/chassis-icon.svg?react';
import Break  from '../assets/brake.svg?react';
import Steering  from '../assets/steering2.svg?react';
import Exhaust  from '../assets/exhaust.svg?react';
import Cooling  from '../assets/radiator.svg?react';
import Turbo  from '../assets/power.svg?react';

export const SERVICES_ITEMS = [
    {
        id: 1,
        label: 'Двигател',
        icon: () => Engine && <Engine className='icon' />,
        intro: 'Компютърната диагностика се извършва, чрез специализиран диагностичен уред наричан "кодочетец", който извършва комуникация с главни електронни модули на електронните системи на автомобила. Прочитане и отстраняване на натрупани грешки, записани в паметта на автомобила по системи: като компютъра за управление на двигателя, антиблокиращата система ABS, климатичната система, въздушни възглавници и др. Специализирана автодиагностика и ремонт на FAP филтри.',
        allServices: [
            {
                title: 'СМЯНА НА ТАМПОН НА ДВИГАТЕЛ',
                description:
                    'Двигателят и скоростната кутия на автомобила се закрепват към купето посредством тампони. Целта и предназначението на тампоните на двигателят е да поемат вибрациите и да направят по-тихо и комфортно шофирането. Тампоните са изработени от две метални части свързани помежду си с гума. С времето гумата се къса и е необходимо тампонът да бъде подменен.',
            },
            {
                title: 'СМЯНА НА ТАМПОН НА ДВИГАТЕЛ',
                description:
                    'Двигателят и скоростната кутия на автомобила се закрепват към купето посредством тампони. Целта и предназначението на тампоните на двигателят е да поемат вибрациите и да направят по-тихо и комфортно шофирането. Тампоните са изработени от две метални части свързани помежду си с гума. С времето гумата се къса и е необходимо тампонът да бъде подменен.',
            },
            {
                title: 'СМЯНА НА ТАМПОН НА ДВИГАТЕЛ',
                description:
                    'Двигателят и скоростната кутия на автомобила се закрепват към купето посредством тампони. Целта и предназначението на тампоните на двигателят е да поемат вибрациите и да направят по-тихо и комфортно шофирането. Тампоните са изработени от две метални части свързани помежду си с гума. С времето гумата се къса и е необходимо тампонът да бъде подменен.',
            },
            {
                title: 'СМЯНА НА ТАМПОН НА ДВИГАТЕЛ',
                description:
                    'Двигателят и скоростната кутия на автомобила се закрепват към купето посредством тампони. Целта и предназначението на тампоните на двигателят е да поемат вибрациите и да направят по-тихо и комфортно шофирането. Тампоните са изработени от две метални части свързани помежду си с гума. С времето гумата се къса и е необходимо тампонът да бъде подменен.',
            },
            {
                title: 'СМЯНА НА ТАМПОН НА ДВИГАТЕЛ',
                description:
                    'Двигателят и скоростната кутия на автомобила се закрепват към купето посредством тампони. Целта и предназначението на тампоните на двигателят е да поемат вибрациите и да направят по-тихо и комфортно шофирането. Тампоните са изработени от две метални части свързани помежду си с гума. С времето гумата се къса и е необходимо тампонът да бъде подменен.',
            },
            {
                title: 'СМЯНА НА ТАМПОН НА ДВИГАТЕЛ',
                description:
                    'Двигателят и скоростната кутия на автомобила се закрепват към купето посредством тампони. Целта и предназначението на тампоните на двигателят е да поемат вибрациите и да направят по-тихо и комфортно шофирането. Тампоните са изработени от две метални части свързани помежду си с гума. С времето гумата се къса и е необходимо тампонът да бъде подменен.',
            },
            {
                title: 'СМЯНА НА ТАМПОН НА ДВИГАТЕЛ',
                description:
                    'Двигателят и скоростната кутия на автомобила се закрепват към купето посредством тампони. Целта и предназначението на тампоните на двигателят е да поемат вибрациите и да направят по-тихо и комфортно шофирането. Тампоните са изработени от две метални части свързани помежду си с гума. С времето гумата се къса и е необходимо тампонът да бъде подменен.',
            },
        ],
    },
    {
        id: 2,
        label: 'Електрическа Система',
        icon: () => <Electric className='icon' />,
    },
    {
        id: 3,
        label: 'Обща Поддръжка',
        icon: () => <Operations className='icon' />,
    },
    {
        id: 4,
        label: 'Трансмисия',
        icon: () => <Transmission className='icon' />,
    },
    {
        id: 5,
        label: 'Ходова Част',
        icon: () => <Chassis className='icon' />,
    },
    {
        id: 6,
        label: 'Спирачна Система',
        icon: () => <Break className='icon' />,
    },
    {
        id: 7,
        label: 'Кормилно Управление',
        icon: () => <Steering className='icon' />,
    },
    {
        id: 8,
        label: 'Изпускателна Система',
        icon: () => <Exhaust className='icon' />,
    },
    {
        id: 9,
        label: 'Охладителна Система',
        icon: () => <Cooling className='icon' />,
    },
    {
        id: 10,
        label: 'Тунинг',
        icon: () => <Turbo className='icon' />,
    },
    {
        id: 11,
        label: 'Диагностика',
        icon: () => <Turbo className='icon' />,
    },
    {
        id: 12,
        label: 'Инспекция и Проверка',
        icon: () => <Turbo className='icon' />,
    },
];
